{"config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "sparse": false, "name": "FeatureNet_ImageInput"}, "name": "FeatureNet_ImageInput", "class_name": "InputLayer"}, {"inbound_nodes": [[["FeatureNet_ImageInput", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "trainable": true, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "filters": 8, "activity_regularizer": null}, "name": "conv2d_5", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_8", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_8", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "name": "activation_8", "class_name": "Activation"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "trainable": true, "name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "filters": 16, "activity_regularizer": null}, "name": "conv2d_6", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_9", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_9", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "name": "activation_9", "class_name": "Activation"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d_3", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "trainable": true, "name": "conv2d_7", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "filters": 16, "activity_regularizer": null}, "name": "conv2d_7", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_10", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_10", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "name": "activation_10", "class_name": "Activation"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"strides": [1, 1], "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "trainable": true, "name": "conv2d_8", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "filters": 32, "activity_regularizer": null}, "name": "conv2d_8", "class_name": "Conv2D"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_11", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_11", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "name": "activation_11", "class_name": "Activation"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}, "name": "max_pooling2d_4", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_2"}, "name": "flatten_2", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_5", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "units": 32}, "name": "dense_5", "class_name": "Dense"}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null}, "name": "dropout_2", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_12", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_12", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "name": "activation_12", "class_name": "Activation"}], "input_layers": [["FeatureNet_ImageInput", 0, 0]], "name": "FeatureGenerationModel", "output_layers": [["activation_12", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}