{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "use_bias": true, "batch_input_shape": [null, 30, 30, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "filters": 32, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_size": [3, 3], "trainable": true, "use_bias": true, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "filters": 64, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "use_bias": true, "kernel_constraint": null, "units": 64, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "use_bias": true, "kernel_constraint": null, "units": 10, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null}}]}}