{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_5", "layers": [{"name": "conv2d_1_input", "class_name": "InputLayer", "config": {"dtype": "float32", "name": "conv2d_1_input", "batch_input_shape": [null, 30, 30, 1], "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "use_bias": true, "batch_input_shape": [null, 30, 30, 1], "strides": [1, 1], "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "filters": 32, "bias_constraint": null}, "inbound_nodes": [[["conv2d_1_input", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_size": [3, 3], "trainable": true, "use_bias": true, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activation": "relu", "activity_regularizer": null, "filters": 64, "bias_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25, "seed": null, "noise_shape": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "use_bias": true, "kernel_constraint": null, "units": 64, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["conv2d_1_input", 0, 0]]}}