{"config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "sparse": false, "name": "ImageA_Input"}, "name": "ImageA_Input", "class_name": "InputLayer"}, {"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "sparse": false, "name": "ImageB_Input"}, "name": "ImageB_Input", "class_name": "InputLayer"}, {"inbound_nodes": [[["ImageA_Input", 0, 0, {}]], [["ImageB_Input", 0, 0, {}]]], "config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "name": "FeatureNet_ImageInput", "sparse": false, "batch_input_shape": [null, 105, 105, 1]}, "class_name": "InputLayer", "name": "FeatureNet_ImageInput"}, {"inbound_nodes": [[["FeatureNet_ImageInput", 0, 0, {}]]], "config": {"filters": 8, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_8", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation", "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"filters": 16, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_9", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation", "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3"}, {"inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"filters": 16, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_7", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_10", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_10"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "class_name": "Activation", "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"filters": 32, "strides": [1, 1], "activation": "relu", "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "trainable": true, "name": "conv2d_8", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_11", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_11"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "class_name": "Activation", "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_4", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_4"}, {"inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_2"}, "class_name": "Flatten", "name": "flatten_2"}, {"inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"trainable": true, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense", "name": "dense_5"}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "config": {"noise_shape": null, "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout", "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_constraint": null, "center": true, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "gamma_constraint": null, "gamma_regularizer": null, "name": "batch_normalization_12", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "name": "batch_normalization_12"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "class_name": "Activation", "name": "activation_12"}], "output_layers": [["activation_12", 0, 0]], "name": "FeatureGenerationModel", "input_layers": [["FeatureNet_ImageInput", 0, 0]]}, "name": "FeatureGenerationModel", "class_name": "Model"}, {"inbound_nodes": [[["FeatureGenerationModel", 1, 0, {}], ["FeatureGenerationModel", 2, 0, {}]]], "config": {"axis": -1, "trainable": true, "name": "merge_features"}, "name": "merge_features", "class_name": "Concatenate"}, {"inbound_nodes": [[["merge_features", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_6", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "units": 64}, "name": "dense_6", "class_name": "Dense"}, {"inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_13", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_13", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "name": "activation_13", "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_7", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "units": 32}, "name": "dense_7", "class_name": "Dense"}, {"inbound_nodes": [[["dense_7", 0, 0, {}]]], "config": {"moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "trainable": true, "gamma_constraint": null, "momentum": 0.99, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "name": "batch_normalization_14", "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "name": "batch_normalization_14", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "name": "activation_14", "class_name": "Activation"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"bias_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_8", "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "use_bias": true, "units": 1}, "name": "dense_8", "class_name": "Dense"}], "input_layers": [["ImageA_Input", 0, 0], ["ImageB_Input", 0, 0]], "name": "Similarity_Model", "output_layers": [["dense_8", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}